reports/ws_prem20[4]_local[0]_1ser[15pool]_3000tunn_5inst_1000user_1m_1sec.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: tunnels.js
     output: -

  scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
           * default: 1000 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 1000 VUs  0m00.8s/1m0s

running (0m01.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  0m01.8s/1m0s

running (0m02.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1000 VUs  0m02.8s/1m0s

running (0m03.8s), 1000/1000 VUs, 23 complete and 0 interrupted iterations
default   [   6% ] 1000 VUs  0m03.8s/1m0s

running (0m04.8s), 1000/1000 VUs, 153 complete and 0 interrupted iterations
default   [   8% ] 1000 VUs  0m04.8s/1m0s

running (0m05.8s), 1000/1000 VUs, 253 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  0m05.8s/1m0s

running (0m06.8s), 1000/1000 VUs, 489 complete and 0 interrupted iterations
default   [  11% ] 1000 VUs  0m06.8s/1m0s

running (0m07.8s), 1000/1000 VUs, 657 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  0m07.8s/1m0s

running (0m08.8s), 1000/1000 VUs, 861 complete and 0 interrupted iterations
default   [  15% ] 1000 VUs  0m08.8s/1m0s

running (0m09.8s), 1000/1000 VUs, 1165 complete and 0 interrupted iterations
default   [  16% ] 1000 VUs  0m09.8s/1m0s

running (0m10.8s), 1000/1000 VUs, 1577 complete and 0 interrupted iterations
default   [  18% ] 1000 VUs  0m10.8s/1m0s

running (0m11.8s), 1000/1000 VUs, 1893 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  0m11.8s/1m0s

running (0m12.8s), 1000/1000 VUs, 2094 complete and 0 interrupted iterations
default   [  21% ] 1000 VUs  0m12.8s/1m0s

running (0m13.8s), 1000/1000 VUs, 2453 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  0m13.8s/1m0s

running (0m14.8s), 1000/1000 VUs, 2851 complete and 0 interrupted iterations
default   [  25% ] 1000 VUs  0m14.8s/1m0s

running (0m15.8s), 1000/1000 VUs, 3513 complete and 0 interrupted iterations
default   [  26% ] 1000 VUs  0m15.8s/1m0s

running (0m16.8s), 1000/1000 VUs, 4229 complete and 0 interrupted iterations
default   [  28% ] 1000 VUs  0m16.8s/1m0s

running (0m17.8s), 1000/1000 VUs, 4861 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  0m17.8s/1m0s

running (0m18.8s), 1000/1000 VUs, 5664 complete and 0 interrupted iterations
default   [  31% ] 1000 VUs  0m18.8s/1m0s

running (0m19.8s), 1000/1000 VUs, 6452 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  0m19.8s/1m0s

running (0m20.8s), 1000/1000 VUs, 7208 complete and 0 interrupted iterations
default   [  35% ] 1000 VUs  0m20.8s/1m0s

running (0m21.8s), 1000/1000 VUs, 7947 complete and 0 interrupted iterations
default   [  36% ] 1000 VUs  0m21.8s/1m0s

running (0m22.8s), 1000/1000 VUs, 8332 complete and 0 interrupted iterations
default   [  38% ] 1000 VUs  0m22.8s/1m0s

running (0m23.8s), 1000/1000 VUs, 8878 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  0m23.8s/1m0s

running (0m24.8s), 1000/1000 VUs, 9683 complete and 0 interrupted iterations
default   [  41% ] 1000 VUs  0m24.8s/1m0s

running (0m25.8s), 1000/1000 VUs, 10439 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  0m25.8s/1m0s

running (0m26.8s), 1000/1000 VUs, 11195 complete and 0 interrupted iterations
default   [  45% ] 1000 VUs  0m26.8s/1m0s

running (0m27.8s), 1000/1000 VUs, 11570 complete and 0 interrupted iterations
default   [  46% ] 1000 VUs  0m27.8s/1m0s

running (0m28.8s), 1000/1000 VUs, 12091 complete and 0 interrupted iterations
default   [  48% ] 1000 VUs  0m28.8s/1m0s

running (0m29.8s), 1000/1000 VUs, 12911 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  0m29.8s/1m0s

running (0m30.8s), 1000/1000 VUs, 13575 complete and 0 interrupted iterations
default   [  51% ] 1000 VUs  0m30.8s/1m0s

running (0m31.8s), 1000/1000 VUs, 14269 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  0m31.8s/1m0s

running (0m32.8s), 1000/1000 VUs, 15040 complete and 0 interrupted iterations
default   [  55% ] 1000 VUs  0m32.8s/1m0s

running (0m33.8s), 1000/1000 VUs, 15794 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  0m33.8s/1m0s

running (0m34.8s), 1000/1000 VUs, 16520 complete and 0 interrupted iterations
default   [  58% ] 1000 VUs  0m34.8s/1m0s

running (0m35.8s), 1000/1000 VUs, 17273 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  0m35.8s/1m0s

running (0m36.8s), 1000/1000 VUs, 18096 complete and 0 interrupted iterations
default   [  61% ] 1000 VUs  0m36.8s/1m0s

running (0m37.8s), 1000/1000 VUs, 18758 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  0m37.8s/1m0s

running (0m38.8s), 1000/1000 VUs, 19502 complete and 0 interrupted iterations
default   [  65% ] 1000 VUs  0m38.8s/1m0s

running (0m39.8s), 1000/1000 VUs, 20274 complete and 0 interrupted iterations
default   [  66% ] 1000 VUs  0m39.8s/1m0s

running (0m40.8s), 1000/1000 VUs, 20559 complete and 0 interrupted iterations
default   [  68% ] 1000 VUs  0m40.8s/1m0s

running (0m41.8s), 1000/1000 VUs, 21331 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  0m41.8s/1m0s

running (0m42.8s), 1000/1000 VUs, 21934 complete and 0 interrupted iterations
default   [  71% ] 1000 VUs  0m42.8s/1m0s

running (0m43.8s), 1000/1000 VUs, 22336 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  0m43.8s/1m0s

running (0m44.8s), 1000/1000 VUs, 22928 complete and 0 interrupted iterations
default   [  75% ] 1000 VUs  0m44.8s/1m0s

running (0m45.8s), 1000/1000 VUs, 23495 complete and 0 interrupted iterations
default   [  76% ] 1000 VUs  0m45.8s/1m0s

running (0m46.8s), 1000/1000 VUs, 24098 complete and 0 interrupted iterations
default   [  78% ] 1000 VUs  0m46.8s/1m0s

running (0m47.8s), 1000/1000 VUs, 24535 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  0m47.8s/1m0s

running (0m48.8s), 1000/1000 VUs, 24959 complete and 0 interrupted iterations
default   [  81% ] 1000 VUs  0m48.8s/1m0s

running (0m49.8s), 1000/1000 VUs, 25652 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  0m49.8s/1m0s

running (0m50.8s), 1000/1000 VUs, 26235 complete and 0 interrupted iterations
default   [  85% ] 1000 VUs  0m50.8s/1m0s

running (0m51.8s), 1000/1000 VUs, 26623 complete and 0 interrupted iterations
default   [  86% ] 1000 VUs  0m51.8s/1m0s

running (0m52.8s), 1000/1000 VUs, 27165 complete and 0 interrupted iterations
default   [  88% ] 1000 VUs  0m52.8s/1m0s

running (0m53.8s), 1000/1000 VUs, 27808 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  0m53.8s/1m0s

running (0m54.8s), 1000/1000 VUs, 28280 complete and 0 interrupted iterations
default   [  91% ] 1000 VUs  0m54.8s/1m0s

running (0m55.8s), 1000/1000 VUs, 28934 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  0m55.8s/1m0s

running (0m56.8s), 1000/1000 VUs, 29540 complete and 0 interrupted iterations
default   [  95% ] 1000 VUs  0m56.8s/1m0s

running (0m57.8s), 1000/1000 VUs, 30001 complete and 0 interrupted iterations
default   [  96% ] 1000 VUs  0m57.8s/1m0s

running (0m58.8s), 1000/1000 VUs, 30618 complete and 0 interrupted iterations
default   [  98% ] 1000 VUs  0m58.8s/1m0s

running (0m59.8s), 1000/1000 VUs, 31243 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  0m59.8s/1m0s

running (1m00.8s), 0621/1000 VUs, 31625 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m01.6s), 0000/1000 VUs, 32246 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  1m0s

     ✓ status is 200

     checks.........................: 100.00% ✓ 32246      ✗ 0     
     data_received..................: 40 MB   655 kB/s
     data_sent......................: 2.6 MB  43 kB/s
     http_req_blocked...............: avg=64.8ms   min=160ns    med=359ns    max=2.23s   p(90)=994ns    p(95)=604.55ms
     http_req_connecting............: avg=22.45ms  min=0s       med=0s       max=1.15s   p(90)=0s       p(95)=215.46ms
     http_req_duration..............: avg=628.12ms min=236.85ms med=311.99ms max=9.49s   p(90)=1.07s    p(95)=1.86s   
       { expected_response:true }...: avg=628.12ms min=236.85ms med=311.99ms max=9.49s   p(90)=1.07s    p(95)=1.86s   
     http_req_failed................: 0.00%   ✓ 0          ✗ 32246 
     http_req_receiving.............: avg=574.17µs min=17.53µs  med=51.2µs   max=1.52s   p(90)=513.03µs p(95)=1.31ms  
     http_req_sending...............: avg=76.89µs  min=21.23µs  med=49.84µs  max=30.33ms p(90)=98.06µs  p(95)=146.06µs
     http_req_tls_handshaking.......: avg=42.22ms  min=0s       med=0s       max=2.01s   p(90)=0s       p(95)=337.2ms 
     http_req_waiting...............: avg=627.47ms min=236.72ms med=311.65ms max=9.49s   p(90)=1.07s    p(95)=1.86s   
     http_reqs......................: 32246   523.742234/s
     iteration_duration.............: avg=1.88s    min=1.23s    med=1.55s    max=12.15s  p(90)=2.33s    p(95)=3.45s   
     iterations.....................: 32246   523.742234/s
     vus............................: 621     min=621      max=1000
     vus_max........................: 1000    min=1000     max=1000